use announcements;

insert into category (categoryId, categoryName)
values (1, 'ทั่วไป'), (2, 'ทุนการศึกษา'), (3, 'หางาน'), (4, 'ฝึกงาน');

insert into announcement (announcementId, announcementTitle, announcementDescription, publishDate, closeDate, announcementDisplay, categories_categoryId)
values
(1, 'บริษัท เน็ตเซอร์พลัส จำกัด รับสมัครงาน 2 ตำแหน่ง', 'บริษัท เน็ตเซอร์พลัส จำกัด เปิดรับสมัครงาน 2 ตำแหน่ง Application Support และ Customer Support', null, null, 'N', 3),
(2, 'รายชื่อนักศึกษาที่ได้รับทุนการศึกษาประเภท "ทุนจ้างงาน" 2/2565', 'คณะ ฯ ประกาศรายชื่อนักศึกษาที่ได้รับทุนการศึกษาประเภท "ทุนจ้างงาน" ประจําภาคการศึกษา 2/2565', null, '2023-05-31 18:00:00+07:00', 'Y', 2),
(3, 'แนวปฎิบัติการสอบออนไลน์ พ.ศ. 2565', 'ประกาศมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี เรื่องแนวทางปฎิบัติการสอบออนไลน์ พ.ศ. 2565', '2023-01-27 06:00:00+07:00', null, 'Y', 1),
(4, 'กิจกรรมพี่อ้อย พี่ฉอด On Tour 2566', 'ขอเชิญนักศึกษาทุกชั้นปี เข้าร่วมกิจกรรมพี่อ้อย พี่ฉอด On Tour', '2023-04-19 06:00:00+07:00','2023-05-08 18:00:00+07:00', 'Y', 1);
